<!-- add-pr-comment:758/cloud/cdktf/website -->

```
cloudflare_r2_bucket.WebsiteBucket: Refreshing state... [id=layertwo-dev-website]
cloudflare_ruleset.WebsiteRuleset: Refreshing state... [id=efc65dc3615f443ab02e16b95f0e9e82]
restapi_object.R2CustomDomainObjectResourceWWW: Refreshing state... [id=www.layertwo.dev]
restapi_object.R2CustomDomainObjectResource: Refreshing state... [id=layertwo.dev]

OpenTofu used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  ~ update in-place

OpenTofu will perform the following actions:

  # cloudflare_r2_bucket.WebsiteBucket will be updated in-place
  ~ resource "cloudflare_r2_bucket" "WebsiteBucket" {
      ~ creation_date = "2025-03-01T06:50:19.824Z" -> (known after apply)
        id            = "layertwo-dev-website"
      + jurisdiction  = "default"
        name          = "layertwo-dev-website"
      + storage_class = "Standard"
        # (1 unchanged attribute hidden)
    }

  # cloudflare_ruleset.WebsiteRuleset will be updated in-place
  ~ resource "cloudflare_ruleset" "WebsiteRuleset" {
        id      = "efc65dc3615f443ab02e16b95f0e9e82"
        name    = "redirect-to-index"
      ~ rules   = [
          ~ {
              ~ action_parameters        = {
                  + algorithms                 = (known after apply)
                  + autominify                 = (known after apply)
                  + browser_ttl                = (known after apply)
                  + cache_key                  = (known after apply)
                  + cache_reserve              = (known after apply)
                  + cookie_fields              = (known after apply)
                  + edge_ttl                   = (known after apply)
                  + from_list                  = (known after apply)
                  + from_value                 = (known after apply)
                  + headers                    = (known after apply)
                  + matched_data               = (known after apply)
                  + origin                     = (known after apply)
                  + overrides                  = (known after apply)
                  + raw_response_fields        = (known after apply)
                  + request_fields             = (known after apply)
                  + response                   = (known after apply)
                  + response_fields            = (known after apply)
                  + serve_stale                = (known after apply)
                  + sni                        = (known after apply)
                  + transformed_request_fields = (known after apply)
                  ~ uri                        = {
                      + query = (known after apply)
                        # (1 unchanged attribute hidden)
                    }
                }
              + categories               = (known after apply)
              + description              = ""
              + exposed_credential_check = (known after apply)
              ~ id                       = "095d47b25024459eb4a85eff637244c7" -> (known after apply)
              + logging                  = (known after apply)
              + ratelimit                = (known after apply)
                # (4 unchanged attributes hidden)
            },
        ]
        # (3 unchanged attributes hidden)
    }

Plan: 0 to add, 2 to change, 0 to destroy.

─────────────────────────────────────────────────────────────────────────────

Saved the plan to: plan

To perform exactly these actions, run the following command to apply:
    tofu apply "plan"

```